# Dataframes parciales de archivos csv en pandas

In [1]:
import pandas as pd

In [2]:
file = 'data.csv'
df = pd.read_csv(file)
df

   numero  letras
0       1     uno
1       2     dos
2       3    tres
3       4  cuatro
4       5   cinco
5       6    seis
6       7   siete
7       8    ocho
8       9   nueve
9      10    diez

In [3]:
df.shape

(10, 2)

## un solo registro

In [4]:
nreg = 2
sub1 = pd.read_csv(file, skiprows=range(1,nreg), nrows=1) # la primera fila del archivo tiene los titulos no debe saltarse
sub1

   numero letras
0       2    dos

In [5]:
sub1.shape

(1, 2)

## desde los registros first a last

In [6]:
first = 4
last = 8
sub2 = pd.read_csv(file, skiprows=range(1,first), nrows=last-first+1)
sub2

   numero  letras
0       4  cuatro
1       5   cinco
2       6    seis
3       7   siete
4       8    ocho

In [7]:
sub2.shape

(5, 2)

## n registros empezando desde el registro first

In [8]:
first = 5
n = 6
sub3 = pd.read_csv(file,skiprows=range(1,first),nrows=n)
sub3

   numero letras
0       5  cinco
1       6   seis
2       7  siete
3       8   ocho
4       9  nueve
5      10   diez

In [9]:
sub3.shape

(6, 2)

## el indice es la columna de numero

In [10]:
df2 = pd.read_csv(file, index_col=0)
df2

        letras
numero
1          uno
2          dos
3         tres
4       cuatro
5        cinco
6         seis
7        siete
8         ocho
9        nueve
10        diez

In [11]:
df2.shape

(10, 1)

In [12]:
df3 = pd.read_csv(file, index_col='numero', skiprows=range(1,3), nrows=1)
df3

       letras
numero
3        tres

In [13]:
df3.shape

(1, 1)